Revit 2027 API
Hardwood.HardwoodImperfectionsShader Property
 The property labeled "Image" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodImperfectionsShader { get; }
Public Shared ReadOnly Property HardwoodImperfectionsShader As String
	Get
public:
static property String^ HardwoodImperfectionsShader {
	String^ get ();
}
static member HardwoodImperfectionsShader : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace